## Initial Setup

In [1]:
# Import MySQL Connector/Python 
import mysql.connector as connector

connection=connector.connect(user="root", password="root")
cursor = connection.cursor()

In [2]:
cursor.execute("DROP DATABASE IF EXISTS little_lemon_db;")

In [3]:
cursor.execute("CREATE DATABASE IF NOT EXISTS little_lemon_db")
cursor.execute("USE little_lemon_db")

In [4]:
#MenuItems table
create_menuitem_table = """CREATE TABLE MenuItems (
ItemID INT AUTO_INCREMENT,
Name VARCHAR(200),
Type VARCHAR(100),
Price INT,
PRIMARY KEY (ItemID)
);"""

create_menu_table = """CREATE TABLE Menus (
MenuID INT,
ItemID INT,
Cuisine VARCHAR(100),
PRIMARY KEY (MenuID,ItemID)
);"""

create_booking_table = """CREATE TABLE Bookings (
BookingID INT AUTO_INCREMENT,
TableNo INT,
GuestFirstName VARCHAR(100) NOT NULL,
GuestLastName VARCHAR(100) NOT NULL,
BookingSlot TIME NOT NULL,
EmployeeID INT,
PRIMARY KEY (BookingID)
);"""

create_orders_table = """CREATE TABLE Orders (
OrderID INT,
TableNo INT,
MenuID INT,
BookingID INT,
BillAmount INT,
Quantity INT,
PRIMARY KEY (OrderID,TableNo)
);"""

create_employees_table = """CREATE TABLE Employees (
EmployeeID INT AUTO_INCREMENT PRIMARY KEY,
Name VARCHAR (255),
Role VARCHAR (100),
Address VARCHAR (255),
Contact_Number INT,
Email VARCHAR (255),
Annual_Salary VARCHAR (100)
);"""

# Create MenuItems table
cursor.execute(create_menuitem_table)

# Create Menu table
cursor.execute(create_menu_table)

# Create Bookings table
cursor.execute(create_booking_table)

# Create Orders table
cursor.execute(create_orders_table)

# Create Employees table
cursor.execute(create_employees_table)

In [5]:
#*******************************************************#
# Insert query to populate "MenuItems" table:
#*******************************************************#
insert_menuitems="""
INSERT INTO MenuItems (ItemID, Name, Type, Price)
VALUES
(1, 'Olives','Starters',5),
(2, 'Flatbread','Starters', 5),
(3, 'Minestrone', 'Starters', 8),
(4, 'Tomato bread','Starters', 8),
(5, 'Falafel', 'Starters', 7),
(6, 'Hummus', 'Starters', 5),
(7, 'Greek salad', 'Main Courses', 15),
(8, 'Bean soup', 'Main Courses', 12),
(9, 'Pizza', 'Main Courses', 15),
(10, 'Greek yoghurt','Desserts', 7),
(11, 'Ice cream', 'Desserts', 6),
(12, 'Cheesecake', 'Desserts', 4),
(13, 'Athens White wine', 'Drinks', 25),
(14, 'Corfu Red Wine', 'Drinks', 30),
(15, 'Turkish Coffee', 'Drinks', 10),
(16, 'Turkish Coffee', 'Drinks', 10),
(17, 'Kabasa', 'Main Courses', 17);"""

# Populate MenuItems table
cursor.execute(insert_menuitems)
connection.commit()

#*******************************************************#
# Insert query to populate "Menu" table:
#*******************************************************#
insert_menu="""
INSERT INTO Menus (MenuID,ItemID,Cuisine)
VALUES
(1, 1, 'Greek'),
(1, 7, 'Greek'),
(1, 10, 'Greek'),
(1, 13, 'Greek'),
(2, 3, 'Italian'),
(2, 9, 'Italian'),
(2, 12, 'Italian'),
(2, 15, 'Italian'),
(3, 5, 'Turkish'),
(3, 17, 'Turkish'),
(3, 11, 'Turkish'),
(3, 16, 'Turkish');"""

# Populate MenuItems table
cursor.execute(insert_menu)
connection.commit()


#*******************************************************#
# Insert query to populate "Orders" table:
#*******************************************************#
insert_orders="""
INSERT INTO Orders (OrderID, TableNo, MenuID, BookingID, Quantity, BillAmount)
VALUES
(1, 12, 1, 1, 2, 86),
(2, 19, 2, 2, 1, 37),
(3, 15, 2, 3, 1, 37),
(4, 5, 3, 4, 1, 40),
(5, 8, 1, 5, 1, 43);"""


# Populate Orders table
cursor.execute(insert_orders)
connection.commit()

In [6]:
#*******************************************************#
# Insert query to populate "Bookings" table:
#*******************************************************#
insert_bookings="""
INSERT INTO Bookings (BookingID, TableNo, GuestFirstName, 
GuestLastName, BookingSlot, EmployeeID)
VALUES
(1, 12, 'Anna','Iversen','19:00:00',1),
(2, 12, 'Joakim', 'Iversen', '19:00:00', 1),
(3, 19, 'Vanessa', 'McCarthy', '15:00:00', 3),
(4, 15, 'Marcos', 'Romero', '17:30:00', 4),
(5, 5, 'Hiroki', 'Yamane', '18:30:00', 2),
(6, 8, 'Diana', 'Pinto', '20:00:00', 5);"""

# Populate Bookings table
cursor.execute(insert_bookings)
connection.commit()

In [7]:
#*******************************************************#
# Insert query to populate "Employees" table:
#*******************************************************#
insert_employees = """
INSERT INTO Employees (EmployeeID, Name, Role, Address, Contact_Number, Email, Annual_Salary) VALUES
(01,'Mario Gollini','Manager','724, Parsley Lane, Old Town, Chicago, IL',351258074,'Mario.g@littlelemon.com','$70,000'),
(02,'Adrian Gollini','Assistant Manager','334, Dill Square, Lincoln Park, Chicago, IL',351474048,'Adrian.g@littlelemon.com','$65,000'),
(03,'Giorgos Dioudis','Head Chef','879 Sage Street, West Loop, Chicago, IL',351970582,'Giorgos.d@littlelemon.com','$50,000'),
(04,'Fatma Kaya','Assistant Chef','132  Bay Lane, Chicago, IL',351963569,'Fatma.k@littlelemon.com','$45,000'),
(05,'Elena Salvai','Head Waiter','989 Thyme Square, EdgeWater, Chicago, IL',351074198,'Elena.s@littlelemon.com','$40,000'),
(06,'John Millar','Receptionist','245 Dill Square, Lincoln Park, Chicago, IL',351584508,'John.m@littlelemon.com','$35,000');"""

# Populate Employees table
cursor.execute(insert_employees)
connection.commit()

# Implement Stored Procedure

In [8]:
from mysql.connector.pooling import MySQLConnectionPool, Error

In [9]:
dbconfig={"database":"little_lemon_db", "user":"root", "password":"root"}

In [10]:
try:
    pool = MySQLConnectionPool(pool_name="pool_a",
                                                  pool_size=2,
                                                  host='localhost',
                                                  **dbconfig)
    print("The connectin pool is created with name:", pool.pool_name)
    print("The pool size is:", pool.pool_size)
except Error as err:
    print(err)

The connectin pool is created with name: pool_a
The pool size is: 2

In [11]:
connection = pool.get_connection()
if connection.is_connected:
    cursor = connection.cursor()

In [12]:
create_peakhours_proc = """
CREATE PROCEDURE PeakHours()
BEGIN
    SELECT 
        HOUR(BookingSlot) AS booking_hour, 
        COUNT(BookingID) AS number_of_bookings
    FROM Bookings
    GROUP BY booking_hour
    ORDER BY number_of_bookings DESC;
END
"""

In [13]:
cursor.execute(create_peakhours_proc)

In [14]:
cursor.callproc('PeakHours')
results = next(cursor.stored_results())
dataset = results.fetchall()

In [15]:
for column_id in cursor.stored_results():
    cols = [column[0] for column in column_id.description]

print(cols)
for data in dataset:
        print(data)

['booking_hour', 'number_of_bookings']
(19, 2)
(15, 1)
(17, 1)
(18, 1)
(20, 1)

In [16]:
create_gueststatus_proc = """CREATE PROCEDURE GuestStatus()
BEGIN
    SELECT CONCAT(GuestFirstName, ' ', GuestLastName) AS full_name,
    CASE
    WHEN Role IN ('Manager', 'Assistant Manager') THEN 'Ready to pay'
    WHEN Role IN ('Head Chef') THEN 'Ready to serve'
    WHEN Role IN ('Assistant Chef') THEN 'Preparing Order'
    WHEN Role IN ('Head Waiter') THEN 'Order served'
    END AS status
    FROM Bookings
    LEFT JOIN Employees
    ON Bookings.EmployeeID=Employees.EmployeeID;
END
"""

In [17]:
cursor.execute(create_gueststatus_proc)

In [18]:
cursor.callproc('GuestStatus')
results = next(cursor.stored_results())
dataset = results.fetchall()

In [19]:
for column_id in cursor.stored_results():
    cols = [column[0] for column in column_id.description]

print(cols)
for data in dataset:
        print(data)

['full_name', 'status']
('Anna Iversen', 'Ready to pay')
('Joakim Iversen', 'Ready to pay')
('Vanessa McCarthy', 'Ready to serve')
('Marcos Romero', 'Preparing Order')
('Hiroki Yamane', 'Ready to pay')
('Diana Pinto', 'Order served')

In [20]:
connection.close()

# Little Lemon Analysis and Sales Report

## Task 1

In [21]:
from mysql.connector.pooling import MySQLConnectionPool, Error

dbconfig={"database":"little_lemon_db", "user":"root", "password":"root"}

try:
    pool = MySQLConnectionPool(pool_name="pool_b",
                                                  pool_size=2,
                                                  host='localhost',
                                                  **dbconfig)
    print("The connectin pool is created with name:", pool.pool_name)
    print("The pool size is:", pool.pool_size)
except Error as err:
    print(err)

The connectin pool is created with name: pool_b
The pool size is: 2

## Task 2

In [22]:
connections = []

In [23]:
connection1 = pool.get_connection()
cursor1 = connection1.cursor()
booking1 = """
INSERT INTO Bookings 
    (TableNo, GuestFirstName, GuestLastName, BookingSlot, EmployeeID)
VALUES
    (8, 'Anees', 'Java', '18:00:00', 6);
"""
cursor1.execute(booking1)
connection1.commit()
connections.append(connection1)

In [24]:
connection2 = pool.get_connection()
cursor2 = connection2.cursor()
booking2 = """
INSERT INTO Bookings 
    (TableNo, GuestFirstName, GuestLastName, BookingSlot, EmployeeID)
VALUES
    (5, 'Bald', 'Vin', '19:00:00', 6);
"""
cursor2.execute(booking2)
connection2.commit()
connections.append(connection2)

In [25]:
try:
    connection3 = pool.get_connection()
except Error:
    print("Adding new connection in the pool.")
    extra_connection = connector.connect(user="root", password="root")
    pool.add_connection(cnx=extra_connection)
    connection3 = pool.get_connection()
    print("'connection3' is added in the pool.")


cursor3 = connection3.cursor()
booking3 = """
INSERT INTO Bookings 
    (TableNo, GuestFirstName, GuestLastName, BookingSlot, EmployeeID)
VALUES
    (12, 'Jay', 'Kon', '19:30:00', 6);
"""
cursor3.execute(booking3)
connection3.commit()
connections.append(connection3)

Adding new connection in the pool.
'connection3' is added in the pool.

In [26]:
for idx, connection in enumerate(connections):
    try:
        connection.close()
        print(f"Returned connection {idx + 1} to the pool")

    except Error as err:
        print(err)

Returned connection 1 to the pool
Returned connection 2 to the pool
Failed adding connection; queue is full

## Task 3

In [27]:
connection = pool.get_connection()
cursor = connection.cursor()

In [28]:
# The name and EmployeeID of the Little Lemon manager.
query_select_get_manager = """
SELECT 
    Name, EmployeeID 
FROM Employees 
    WHERE Role = 'Manager'
"""

cursor.execute(query_select_get_manager)
results = cursor.fetchall()
columns = cursor.column_names
print(columns)
for result in results:
    print(result)

('Name', 'EmployeeID')
('Mario Gollini', 1)

In [29]:
# The name and role of the employee who receives the highest salary.
query_select_highest_salary = """
SELECT 
    Name, EmployeeID 
FROM Employees ORDER BY 
    Annual_Salary DESC LIMIT 1
"""

cursor.execute(query_select_highest_salary)
results = cursor.fetchall()
columns = cursor.column_names
print(columns)
for result in results:
    print(result)

('Name', 'EmployeeID')
('Mario Gollini', 1)

In [30]:
# The number of guests booked between 18:00 and 20:00.
query_select_booked_beetwen = """
SELECT 
    COUNT(BookingID) as bookings
FROM Bookings 
    WHERE BookingSlot BETWEEN '18:00:00' AND '20:00:00';
"""

cursor.execute(query_select_booked_beetwen)
results = cursor.fetchall()
columns = cursor.column_names
print(columns)
for result in results:
    print(result)

('bookings',)
(7,)

In [31]:
# The full name and BookingID of all guests waiting to be seated with the receptionist in sorted order with respect to their BookingSlot.
cursor.execute(
    """
SELECT 
    Bookings.BookingID AS id,  
    CONCAT(GuestFirstName, ' ', GuestLastName) AS guest_name, 
    Role AS Employee
FROM Bookings 
    LEFT JOIN Employees 
    ON Employees.EmployeeID = Bookings.EmployeeID
    WHERE Employees.Role = "Receptionist"
    ORDER BY BookingSlot DESC;
"""
)

print("The following guests are waiting to be seated:")
results = cursor.fetchall()
columns = cursor.column_names
print(columns)
for result in results:
    print(result)

The following guests are waiting to be seated:
('id', 'guest_name', 'Employee')
(9, 'Jay Kon', 'Receptionist')
(8, 'Bald Vin', 'Receptionist')
(7, 'Anees Java', 'Receptionist')

# Task 4

In [32]:
# Create a stored procedure named BasicSalesReport.
cursor.execute("DROP PROCEDURE IF EXISTS BasicSalesReport;")

stored_procedure_query_bassic_sales_report = """
CREATE PROCEDURE BasicSalesReport()
BEGIN
    SELECT 
        SUM(BillAmount) AS Total_Sale,
        AVG(BillAmount) AS Average_Sale,
        MIN(BillAmount) AS Min_Bill_Paid,
        MAX(BillAmount) AS Max_Bill_Paid
    FROM Orders;
END
"""
cursor.execute(stored_procedure_query_bassic_sales_report)
cursor.callproc("BasicSalesReport")

# Retrieve records in "dataset"
results = next(cursor.stored_results())
results = results.fetchall()

# Retrieve column names using list comprehension in a for loop
for column_id in cursor.stored_results():
    cols = [column[0] for column in column_id.description]

print("Today's sales report:")
for result in results:
    print(cols[0], ":", result[0])
    print(cols[1], ":", result[1])
    print(cols[2], ":", result[2])
    print(cols[3], ":", result[3])

Today's sales report:
Total_Sale : 243
Average_Sale : 48.6000
Min_Bill_Paid : 37
Max_Bill_Paid : 86

# Task 5

In [33]:
cursor = connection.cursor(buffered=True)

In [34]:
cursor.execute("DROP PROCEDURE IF EXISTS UpcomingBookings;")
stored_procedure_query_UpcomingBookings = """
CREATE PROCEDURE UpcomingBookings()
BEGIN
SELECT 
	CONCAT("BookingSlot", " ", b.BookingSlot) as booking_slot,
	CONCAT("Guest_name:", " ", CONCAT(b.GuestFirstName," ",b.GuestLastName)) as guest_name,
	CONCAT("Asign to:", " ", CONCAT(e.Name, " [", e.Role, "]")) AS assign_to
FROM Bookings b
INNER JOIN Employees e
ON e.EmployeeID = b.EmployeeID
ORDER BY b.BookingID DESC limit 10;
END
"""

cursor.execute(stored_procedure_query_UpcomingBookings)

cursor.callproc("UpcomingBookings")
results = next(cursor.stored_results())
results = results.fetchmany(size=3)

for result in results:
    print("\n", result[0])
    print(result[1])
    print(result[2])
connection.close()

 BookingSlot 19:30:00
Guest_name: Jay Kon
Asign to: John Millar [Receptionist]

 BookingSlot 19:00:00
Guest_name: Bald Vin
Asign to: John Millar [Receptionist]

 BookingSlot 18:00:00
Guest_name: Anees Java
Asign to: John Millar [Receptionist]